Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/going_abroad_and_social_welfare_payments.html.txt.tmx
Source language: en
Languages: ga

source: Going abroad or on holidays and social welfare payments
ga: Ag dul thar lear chun bheith i do chónaí nó ar laethanta saoire agus íocaíochtaí leasa shóisialaigh

source: You can get certain Irish social welfare payments and live in another country
ga: Is féidir leat íocaíochtaí leasa shóisialaigh Éireannacha áirithe a fháil agus cónaí ort i dtír eile

source: You can also continue to get certain social welfare payments if you are on holiday abroad for a specific period of time or if you are getting medical treatment abroad
ga: Is féidir leat leanúint ag fáil íocaíochtaí leasa shóisialaigh má tá tú ar saoire thar lear ar feadh tréimhse shonrach ama nó má tá tú ag fáil cóireála leighis thar lear

source: Most social insurance payments can be paid to you outside of this state, though the duration can depend on the payment and your circumstances
ga: Is féidir an chuid is mó d'íocaíochtaí leasa shóisialaigh a íoc leat lasmuigh den stát seo, cé gur féidir leis an tréimhse brath ar an íocaíocht agus ar do chúinsí

source: However, to get a social assistance payment you must live in the State
ga: Chun íocaíocht cúnaimh shóisialta a fháil, áfach, caithfidh tú cónaí a bheith ort in Éirinn

source: Holidays and social welfare payments
ga: Laethanta Saoire thar lear

source: In general you can take up to 2 weeks holidays each year and have your social welfare payment paid
ga: De ghnáth, is féidir leat suas go 2 sheachtain saoire sa bhliain a thógáil agus is féidir d'íocaíocht leasa shóisialaigh a bheith íoctha leat

source: However you must always contact your local Intreo Centre, Social Welfare Branch Office or your Department of Social Protection representative (formerly known as the Community Welfare Officer) to check your entitlements before planning or taking holidays
ga: Áfach, caithfidh tú teagmháil a dhéanamh ar d'oifig leasa shóisialaigh chun do theidlíochtaí a sheiceáil roimh shaoire a thógáil nó a phleanáil

source: If you plan to take longer holidays or to be abroad for an extended period your social welfare payment may not be paid
ga: Má tá tú ar intinn saoire níos faide a thógáil nó dul thar lear ar feadh tréimhse fhada, d'fhéadhfadh nach n-íocfar d'íocaíocht leasa shóisialaigh leat

source: If you are getting Jobseeker's Allowance or Jobseeker's Benefit you can go on holiday for a maximum of 2 weeks and get the 2 weeks payment on your return
ga: Má tá tú ag fáil Liúntais Cuardaitheora Poist agus Sochar Cuardaitheora Poist is féidir leat dul ar saoire ar feadh uasmhéid de 2 sheachtain agus 2 sheachtain íocaíochta a fháil nuair a fhilleann tú

source: You must notify your Intreo Centre or Social Welfare Branch Office before taking your holiday. Some social welfare offices allow you to apply for holidays online
ga: Glactar ar líne le hiarratais ar laethanta saoire ó chustaiméirí d'Oifigí Leasa Shóisialaigh Áitiúla áirithe

source: Both payments can also be paid on your return from representing Ireland in an amateur capacity at international sporting event
ga: Caithfidh tú fógra a thabhairt dod' oifig áitiúil leasa shóisialaigh roimh duit do shaoire 2 sheachtain a thógáil

source: You must get written confirmation of the sport and time involved from the governing sporting body
ga: Is féidir é a íoc chomh maith nuair a fhilleann tú ó ionadaíocht a dhéanamh d'Éirinn i gcáil amaitéaraigh ag ócáid idirnáisiúnta spóirt

source: If you are getting Pre-Retirement Allowance you can go on holiday for a maximum of 2 weeks and cash your payment order on your return
ga: Ma tá tú ag fáil Liúntais Réamhscoir is féidir leat dul ar saoire ar feadh uasmhéid de 2 seachtaine agus d'ordú íocaíochta a dhéanamh nuair a fhilleann tú

source: If you go on holiday for more than 2 weeks you must return your payment book before you go on holiday abroad
ga: Má théann tú ar saoire ar feadh níos faide ná 2 seachtaine caithfidh tú do leabhar íocaíochta a thabhairt ar ais roimh dhul ar saoire thar lear duit

source: When you return you will get your payment book back but will only get a payment for 2 weeks of your holiday
ga: Nuair a fhilleann tú gheobhaidh tú do leabhar íocaíochta ar ais ach ní bhfaighidh tú ach íocaíocht do 2 seachtaine de do shaoire

source: Irish social welfare payments paid outside the State
ga: Íocaíochtaí leasa shóisialaigh Éireannacha íoctha lasmuigh den stát

source: If you are living outside the Irish State, the following social welfare payments can be paid abroad:
ga: Má tá tú ag cónaí lasmuigh de stát na hÉireann, is féidir na híocaíochtaí leasa shóisialaigh a leanas a íoc:

source: The Constant Attendance Allowance increase is only paid for up to 6 months
ga: Ní íoctar An Liúntas Freastail Leanúnaigh ach amháin suas go dtí tréimhse 6 mhí

source: However, if you are abroad for medical treatment you may continue to get Incapacity Supplement, such claims are assessed on a case by case basis
ga: Má tá tú thar lear do chóireáil leighis, áfach, leanfaidh tú ag fáil Forlíonadh Éagumais, tá na héilimh seo measúnaithe ag curgach cás san áireamh

source: • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension
ga: • Pinsean Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: • Death Benefits under the Occupational Injury Benefit Scheme
ga: • Sochair Báis faoin Scéim um Shochar Dhíobhálacha Ceirde,

source: If you are getting one of these social welfare payments and you are going abroad for just a few weeks, you do not have to notify the Department of Social Protection
ga: Má tá tú ag fáil ceann de na híocaíochtaí leasa shóisialaigh thuas agus go bhfuil tú ag dul thar lear ar feadh cúpla seachtaine amháin, ní chaithfidh tú fógra a thabhairt don Roinn Coimirce Sóisialaí

source: If you are going abroad for a long period of time or moving abroad permanently you must notify the Department
ga: Má tá tú ag dul thar lear ar feadh tréimhse fhada ama nó ag aistriú thar lear go buan caithfidh tú fógra a thabhairt don Roinn

source: You will be asked to produce evidence to prove that you continue to fulfil the qualifying conditions for the payment
ga: Iarrfar ort fianaise a sholáthar chun cruthú go dtagann tú faoi na coinníollacha cáiliúcháin don íocaíocht fós

source: For example, you must not be married or in a new civil partnership or cohabitating with someone to continue to get a Widow's, Widower's or Surviving Civil Partner's Contributory Pension
ga: Mar shampla, má aistríonn tú thar lear, ní féidir leat a bheith pósta nó ag cónaí le duine éigin mar fhear céile nó bean chéile chun leanúint ag fáil an Phinsin Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Ranníocach)

source: To get your social welfare benefit paid to you abroad, you must contact the section in the Department of Social Protection that pays your payment and give your bank account details so that they can transfer your payment directly into a bank account while you are abroad
ga: Chun do shochar leasa shóisialaigh a fháil íoctha leat thar lear, caithfidh tú teagmháil a dhéanamh leis an rannóg den Roinn Coimirce Sóisialaí (RCS) a íocann d'íocaíocht agus tabhair do shonraí cuntais bhainc ionas gur féidir leo d'íocaíocht a aistriú

source: You must always notify the Department of a permanent or temporary absence from the State and give your contact address abroad
ga: Caithfidh tú fógra a thabhairt don Roinn i gcónaí d'asláithreacht bhuan nó shealadach ón Stát agus do sheoladh teagmhála thar lear a thabhairt

source: Payments made abroad in limited situations
ga: Íocaíochtaí a dhéantar thar lear ar chúinsí teoranta

source: Injury Benefit can be paid abroad if you are getting approved medical treatment
ga: Is féidir Sochar Díobhála a íoc thar lear má tá tú ag fáil cóireála leighis fhaofa

source: Illness Benefit can be paid for a maximum of 4 weeks while you are on holiday in a country covered by EU Regulations and 3 weeks in other countries
ga: Má tá tú ar saoire thar lear, d’fhéadfaí Sochar Breoiteachtaa bheith íoctha suas go dtí uasmhéid 4 seachtaine i dtír atá clúdaithe ag Rialacháin AE nó suas go dtí uasmhéid 3 seachtaine i dtíortha eile

source: You can continue to get Illness Benefit if you go to live in another country covered by EU Regulations
ga: Áfach, caithfidh tú an uile chritéir cháilithe i gcomhair Sochair Bhreoiteachta a chomhlánú, lena n-áirítear teastais leighis a chur isteach chuig an RCS

source: However, you must still meet all the qualifying criteria for Illness Benefit which includes submitting medical certificates to DSP
ga: Féadfaidh tú leanúint agus Sochar Breoiteachta a fháil má fhágann tú Éire chun cónaí thar lear i dtír eile atá faoi chuimsiú Rialacháin an AE

source: If you go to live in another country covered by EU Regulations and become ill you may apply for Illness Benefit from Ireland if you paid your last insurance contribution in Ireland or you were getting Jobseeker’s Benefit in Ireland before you went abroad
ga: Má fhágann tú Éire chun cónaí i dtír eile atá faoi chuimsiú Rialacháin an AE, agus má éiríonn tú breoite, féadfaidh tú iarratas a dhéanamh ar Shochar Breoiteachta ó Éirinn má d’íoc tú do ranníocaíocht árachais dheireanach in Éirinn nó má bhí Sochar Cuardaitheora Poist á fháil agat in Éirinn sula ndeachaigh tú thar lear

source: Illness Benefit is not paid in countries not covered by EU Regulations
ga: Ní íoctar Sochar Breoiteachta i dtíortha nach bhfuil faoi chuimsiú Rialacháin an AE

source: However, if you go to a country not covered by EU regulations to get approved treatment your payment may resume when you return
ga: Má théann tú chuig tír nach bhfuil faoi chuimsiú Rialacháin an AE chun cóireáil fhaofa a fháil, féadtar leanúint le

source: EU and non-EU citizens can travel abroad and get Maternity Benefit or Adoptive Benefit for a maximum of 6 weeks while away
ga: d’íocaíocht nuair a fhilleann tú

source: To get Maternity Benefit or Adoptive Benefit paid while abroad, you must notify the Department in advance of travel
ga: Is féidir Sochar Uchtála agus Sochar Máithreachais a bheith íoctha thar lear, má tá tú ag fáil cóireála leighius fhaofa

source: If you are working in another EEA member state you may qualify for benefit, if you continue to be insured under the Irish Social Welfare Acts
ga: Má tá tú ag obair i mballstát LEE eile fhéadfá cáiliú do shochar má leanann tú de bheith faoi árachas ag Achtanna Leasa Shóisialaigh na hÉireann

source: Paternity Benefit can be paid abroad to both EU and non-EU citizens for a maximum of 2 weeks. You must notify the Department in advance of travel
ga: Más ó thír den Aontas Eorpach tú, is féidir an Sochar Uchtaíoch nó Sochar Máithreachais a íoc leat i leith tréimhse ar bith de do shaoire uchtaíoch a chaitheann tú i dtír eile den Aontas Eorpach

source: Jobseeker's Benefit (JB) may be transferred to another EEA member state for up to 13 weeks (78 days), if you are looking for work there
ga: D'fhéadfaí Sochar Cuardaitheora Poist (SCP) a bheith aistrithe go ballstát LEE eile suas go dtí 13 seachtaine, má tá tú ag cuardach oibre ansin

source: You must be getting Jobseeker's Benefit for 4 weeks before you can transfer it to another EEA member state (this requirement can be waived in some instances)
ga: Caithfidh tú Sochar Cuardaitheora Poist a bheith íoctha agat ar feadh 4 seachtaine sula n-aistreofá í go dtí ballstáit AE eile

source: From 1 May 2010 new EU Regulations came into effect (pdf) which mean that if you apply to transfer your Jobseeker's Benefit, it will be paid directly to you
ga: Ó 1 Bealtaine 2010 tháinig Rialacháin AE nua i bhfeidhm (pdf)

source: If an Increase for a Qualified Adult (IQA) or Increases for Qualified Children (IQC) are being paid you continue to be paid these in the normal way (whether your dependents travel abroad with you or not)
ga: Ciallaíonn sé má iarrann tú do Shochar Cuardaitheora Poist a aistriú thar lear íocfar é leat go díreach

source: You are still required to register with the employment services of the country where you have gone to look for work within a week
ga: Ní mór duit clárú leis na seirbhísí fostaíochta sa tír ina bhfuil tú ar lorg oibre laistigh seachtain amháin

source: If you are leaving Ireland to move to Northern Ireland or Britain your Intreo Centre or Social Welfare Branch Office will issue you with the Form U2 (formerly Form E303) which you take to the UK social services
ga: Má tá tú ag fágáil Éireann chun bogadh go Tuaisceart Éireann nó an Bhreatain, eiseoidh d'Oifig Áitiúil Leasa Shóisialaigh Foirm U2 (Foirm E303 roimhe seo) duit chun é a thógáil go dtí na seirbhísí sóisialta RA

source: If you are moving to another EU country the Department of Social Protection will send the U2 form to your new address in that EU country
ga: Má bhogann tú go tír eile san AE, seolfaidh an Roinn Coimirce Sóisialaí foirm U2 chuig do sheoladh nua sa tír AE

source: You may transfer your JB payment more than once while you are unemployed provided you do not exceed the maximum period of 13 weeks
ga: Is féidir leat do Shochar Cuardaitheora Poist a aistriú níos mó ná uair amháin agus atá tú dífhostaithe freisin ar choinníoll nach dtéann tú thar an uasteorainn 13 seachtaine

source: If you are claiming JB you can claim increases for your qualified adult and children who are living in another EEA member state
ga: Caithfidh tú dearbhú scríofa den spórt agus den am a bhaineann leis a fháil ón mbord rialaithe spóirt. Is féidir leat dul ar laethanta saoire thar lear suas go dtí 2 seachtaine in aghaidh na bliana

source: Carer's Benefit can be paid if you accompany the person you are caring for abroad to get medical treatment
ga: Is féidir Sochar Cúramóra a íoc má théann tú thar lear in éineacht le duine a bhfuil tú ag déanamh cúraim dóibh chun cóireáil leighis a fháil

source: You can also go abroad on a respite break for a maximum of 3 weeks
ga: Is féidir leat dul thar lear chomh maith ar saoire fhaoisimh ar feadh uasmhéid de 3 seachtaine

source: Carer's Benefit may be paid to a carer resident in any country within the EU who is providing full-time care and attention to another person in that country, provided the qualifying conditions have been met in relation to the Carer's Benefit legislation
ga: Is féidir Sochar Cúramóra a íoc le cúramóir atá ina chónaí in aon tír laistigh den AE agus ag tabhairt cúram lánaimseartha do dhuine eile sa tír sin a bhfuil gá acu le cúram agus aire lánaimseartha, chomh fada agus go gcomhlánaítear na coinníollacha cáilithe i gcomhar reachtaíochta Sochair Cúramóra

source: The following payments are not paid outside the State
ga: Ní dhéantar na híocaíochtaí a leanas a íoc lasmuigh den stát:

source: • Health and Safety Benefit
ga: • Sochar Sláinte agus Sábháilteachta

source: Rent Supplement is not normally payable while you are outside the country
ga: Ní gnách Forlíonadh Cíosa a íoc fad a bhíonn tú lasmuigh den tír

source: You should contact the officer dealing with your claim if you intend to leave the country, even for a short absence
ga: Ba cheart duit é a chur in iúl don oifigeach atá ag plé le d'éileamh má tá sé i gceist agat an tír a fhágáil, fiú ar feadh tamall gearr

source: Payment may be made in certain circumstances for short absences from the country, such as holidays etc., if the officer dealing with your claims agrees to it
ga: D'fhéadfaí an Forlíonadh a íoc i gcásanna áirithe de shaoire nó de thréimhse ghearr lasmuigh den tír ach cead an oifigigh atá ag plé le d'éileamh a fháil

source: The following payments are not paid if you are outside the State but there are some exceptions depending on your circumstances
ga: Ní íoctar na híocaíochtaí a leanas má tá tú lasmuigh den stát ach tá eisceachtaí áirithe ag brath ar do chúinsí

source: Deserted Wife's Benefit can be paid up to a maximum of 3 weeks
ga: Is féidir Sochar Banchéile Thréigthe a íoc suas go dtí uasmhéid de 3 seachtaine

source: Carer's Allowance can be paid if you accompany the person you are caring for abroad to get medical treatment
ga: Is féidir Liúntas Cúramóra a íoc má théann tú thar lear in éineacht le duine a bhfuil tú ag déanamh cúraim dóibh chun cóireáil leighis a fháil

source: Disability Allowance can be paid if you are studying an approved course outside the State under the Back to Education Allowance Scheme or getting medical treatment not available in Ireland
ga: Is féidir Liúntas Míchumais a íoc má tá tú ag staidéar cúrsa fhaofa laistigh den Stát faoin Scéim Liúntas um Fhilleadh ar Oideachas nó ag fáil cóireála leighis nach bhfuil ar fáil in Éirinn

source: You must notify the Department and provide proof of medical treatment or education abroad
ga: Caithfidh tú fógra a thabhairt don Roinn agus fianaise cóireála leighis nó oideachais thar lear a sholáthar

source: Under legislation you have no entitlement to be paid Disability Allowance while on holiday
ga: Faoin reachtaíocht níl tú i dteideal Liúntas Míchumaís a bheith íoctha leat nuair tá tú ar saoire

source: However, in practice Disability Allowance may be paid for 2-3 weeks while you are on holiday abroad. You should inform the Department of Social Protection before you go on holiday
ga: Áfach, má tá tú ar saoire ar feadh 2-3 seachtain, d'fhéadfadh Liúntas Míchumaís a bheith íoctha leat iarbhír

source: One-Parent Family Payment can be paid up to a maximum of 3 weeks while you are on holiday abroad
ga: Is féidir Íocaíocht Teaglaigh Aontuismitheora a íoc suas go dtí uasmhéid de 3 seachtaine nuair atá tú ar saoire thar lear

source: You must notify the Department in advance that you are going abroad
ga: Caithfidh tú fógra a thabhairt don Roinn roimh dhul thar lear

source: If you are getting Widow's, Widower's or Surviving Civil Partner's (Non-Contributory) Pension, State Pension (Non-Contributory) and Blind Pension you can go abroad in exceptional circumstances for a maximum of 13 weeks
ga: Is féidir leat dul thar lear i gcúinsí eisceachtúla ar feadh uasmhéid de 13 seachtaine le Pinsin Baintrí, Baintrí Fir nó Páirtnéara Shibhialta Mharthanaigh (Neamhranníocach), Pinsean Stáit (Neamhranníocach) agus Pinsean na nDall

source: You will get your payment when you return
ga: Gheobhaidh tú d'íocaíocht nuair a fhilleann tú

source: If you are getting State Pension (Non-Contributory) or Blind Pension and take up residence in Northern Ireland, the pension is payable until you become entitled to an equivalent payment from Northern Ireland or for a period of 5 years whichever is the shorter
ga: Má fhaigheann tú Pinsean Stáit (Neamh-Ranníocach) nó Pinsean na nDall agus má tá tú i do chónaí i dTuaisceart na hÉireann, beidh an pinsean íoctha leat go dtí go mbeidh tú i dteideal íocaíocht choibhéiseach ó Thuaisceart na hÉireann nó ar feadh tréimhse 5 bhliain, pé acu is giorra

source: Child Benefit can be paid to volunteer development workers and members of the Irish Defence Forces or Irish Civil Service serving abroad
ga: Is féidir Sochar Linbh a íoc le hoibrithe forbartha dheonacha agus baill d'Fhórsaí Cosanta na hÉireann nó de Státseirbhís na hÉireann atá ag freastal thar lear

source: It can also be paid if you are working abroad for an Irish employer and paying Irish social insurance contributions
ga: Is féidir é a íoc chomh maith má tá tú ag obair thar lear d'fhostóir Éireannach agus ag íoc ranníocaíochtaí árachais shóisialta Éireannacha

source: For further information about transferring your social welfare payment abroad, or taking holidays while getting a social welfare payment, contact the section in the Department of Social Protection that pays your social welfare payment or your local Intreo Centre or Social Welfare Branch Office
ga: Chun treis eolais a fháil faoi d'íocaíocht leasa shóisialaigh a aistriú thar lear, nó saoire a thógáil nuair atá tú ag fáil íocaíochta leasa shóisialaigh, déan teagmháil leis an Rannóg san Roinn Coimirce Sóisialaí a d'ionad Intreo nó d'oifig áitiúil leasa shóisialaigh

source: The Department of Social Protection provides a Lo-call telephone number: 1890 500 000
ga: Cuireann an Roinn Coimirce Sóisialaí uimhir theileafóin Lóghlao ar fáil; is costas ghlaoch áitiúil a ghearrfar ort ar an nglaoch
